###############################################################################
# Created by write_sdc
###############################################################################
current_design freq_psc
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 5.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psc[0]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psc[10]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psc[11]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psc[12]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psc[13]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psc[14]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psc[15]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psc[16]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psc[17]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psc[18]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psc[19]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psc[1]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psc[20]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psc[21]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psc[22]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psc[23]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psc[24]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psc[25]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psc[26]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psc[27]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psc[28]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psc[29]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psc[2]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psc[30]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psc[31]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psc[3]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psc[4]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psc[5]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psc[6]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psc[7]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psc[8]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psc[9]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {out}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {psc[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {psc[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {psc[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {psc[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {psc[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {psc[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {psc[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {psc[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {psc[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {psc[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {psc[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {psc[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {psc[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {psc[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {psc[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {psc[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {psc[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {psc[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {psc[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {psc[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {psc[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {psc[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {psc[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {psc[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {psc[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {psc[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {psc[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {psc[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {psc[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {psc[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {psc[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {psc[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
